
using BlApi;

namespace BlImplementation;

internal class ScheduleImplementation:ISchedule
{
   //        קלט : רשימת תלויות של משימות
  //פלט : רשימת תלויות חדשה בין אבני דרך ומשימות

   //ניצור מתוך רשימת התלויות רשימה מקובצת כך שהמפתח הוא משימה תלויה והערך הוא רשימה של משימות קודמות, ניתן להשתמש בפונקציית GroupBy
  //נמיין את רשימת הערכים
  //ניצור רשימה מסוננת נוספת של  רשימת הערכים כך שכל ערך יופיע פעם אחת, ניתן להשתמש בפונקציה Distinct
  //עבור כל ערך(רשימה של משימות קודמות) שנותר ברשימה המסוננת
  //נייצר אבן דרך.
  //ברשימת התלויות החדשה, נוסיף תלויות בין אבן דרך (מספר מזהה של משימה תלויה) וכל המשימות הקודמות(מספר מזהה של משימה קודמת)
  //לכל מפתח(משימה תלויה) ברשימה המקובצת והממויינת, נוסיף ברשימת התלויות החדשה תלות בין המשימה התלויה הנוכחית לאבן הדרך(מספר מזהה של משימה קודמת) המייצגת את רשימת המשימות הקודמות
  //נייצר אבן דרך נוספת המציינת את תחילת הפרויקט
  //נוסיף תלות עבור כל משימה שלא תלויה באף משימה קודמת לאבן דרך המציינת את תחילת הפרויקט


}
